Revit 2027 API
TilePatterns.GetTilePattern Method
 Retrieve a TilePattern object from a built-in type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TilePattern GetTilePattern(
	TilePatternsBuiltIn tilePatternBuiltIn
)
Public Function GetTilePattern (
	tilePatternBuiltIn As TilePatternsBuiltIn
) As TilePattern
public:
TilePattern^ GetTilePattern(
	TilePatternsBuiltIn tilePatternBuiltIn
)
member GetTilePattern :
        tilePatternBuiltIn : TilePatternsBuiltIn -> TilePattern
Parameters
tilePatternBuiltIn TilePatternsBuiltIn
Return Value
TilePattern
A TilePattern object, or null if the document is not a Massing Family.
See Also
Reference
TilePatterns Class
Autodesk.Revit.DB Namespace